{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 1,
      "special": true,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 2,
      "special": true,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 3,
      "special": true,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 4,
      "special": true,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": {
    "type": "Strip",
    "strip_left": true,
    "strip_right": true
  },
  "pre_tokenizer": {
    "type": "CharDelimiterSplit",
    "delimiter": "-"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "unk_id": 3,
    "vocab": [
      [
        "<s>",
        0.0
      ],
      [
        "<pad>",
        0.0
      ],
      [
        "</s>",
        0.0
      ],
      [
        "<unk>",
        0.0
      ],
      [
        "<mask>",
        0.0
      ],
      [
        "G",
        -1.4848956599484155
      ],
      [
        "ZNT",
        -1.4848956599484155
      ],
      [
        "AHU",
        -1.4848956599484155
      ],
      [
        "A",
        -3.3177289932817486
      ],
      [
        "Z",
        -3.317828993281749
      ],
      [
        "H",
        -3.3179289932817486
      ],
      [
        "N",
        -3.318028993281749
      ],
      [
        "T",
        -3.3181289932817486
      ],
      [
        "U",
        -3.318228993281749
      ],
      [
        "3",
        -3.318228993281749
      ],
      [
        "4",
        -3.318228993281749
      ],
      [
        "1",
        -3.318228993281749
      ],
      [
        "2",
        -3.318228993281749
      ]
    ]
  }
}